package 마무리문제;


public class 마무리문제 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		// 1. 기본형 형변환 중, 아래 코드를 수정해보세요.
//		int x = 100;
//		byte y = (byte)x;
		
		// 2. 참조형 형변환이 되는 조건은?
		// 상속
		
		// 3. 상속에서 위에 물려주는 클래스는?
		// 부모클래스, super 클래스
		
		// 4. 상속에서 아래 물려받는 클래스는?
		// 자식클래스, sub클래스
		
		// 5. 상속을 사용할 때 키워드는 다음중 무엇인가?
		//   1) extent 2) extends 3) implements
		//    2번
		
		// 6. 기본형 데이터 4가지 - 정수, 실수, 문자1, 논리
		
		// 7. 참조형 데잍 ㅓ2가지 이상 - 배열, 클래스
		
		// 8. 참조형 형변환 중, 아래코드를 수정하자.
//		Car c = new Car();
//		Truck t = new Truck();
//		t = (Truck)c;
		
		// 9. 기본형, 참조형 변수에 각각 들어있는 것은?
		//    기본형(값), 참조형(주소)
		
		// 10. 참조형 변수를 초기화 하려고 한다. 무엇으로 초기화해야할까? = null
		
		// 11. null이란? = 주소가 없다.
		
		// 12. 포장클래스(랩퍼클래스)란? 2가지 = 기본형을 클래스로 만들어 놓은것.
		//		Integer, Double, Boolean, Character
		
		// 13. 업캐스팅이란? 부모클래스로 자식클래스의 타입을 변환한다.
		
		// 15. 다운캐스팅이란? 자식클래스로 부모클래스의 타입을 변환한다.
		
		
		
		
		
	}

}
